Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
/**\mainpage
 * Copyright (C) 2016 - 2017 Bosch Sensortec GmbH
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * Neither the name of the copyright holder nor the names of the
 * contributors may be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDER
 * OR CONTRIBUTORS BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
 * OR CONSEQUENTIAL DAMAGES(INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE
 *
 * The information provided is believed to be accurate and reliable.
 * The copyright holder assumes no responsibility
 * for the consequences of use
 * of such information nor for any infringement of patents or
 * other rights of third parties which may result from its use.
 * No license is granted by implication or otherwise under any patent or
 * patent rights of the copyright holder.
 *
 * File		bme280.c
 * Date		13 Jul 2017
 * Version	3.3.0
 *
 */

/*! @file bme280.c
    @brief Sensor driver for BME280 sensor */
    #include "bme280.h"
    #include <stdio.h>
    #include "boards.h"
    #include "app_util_platform.h"
    #include "app_error.h"
    #include "nrf_drv_twi.h"
    #include "nrf_delay.h"
    #include "nrf_log.h"
    #include "nrf_log_ctrl.h"
    #include "app_uart.h"
    #include "nrf_log_default_backends.h"
    
    #define MAX_TEST_DATA_BYTES     (15U)                /**< max number of test bytes to be used for tx and rx. */
    #define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
    #define UART_RX_BUF_SIZE 256                         /**< UART RX buffer size. */
        
    #define BME280_INSTANCE_ID 0
    #define BME280_ADDRESSES 0x76U // connection to V-DDIO
    #define CONFIG 0xf3U
    #define CTRL_MEAS 0xf4U
    #define CTRL_HUM 0xf2U
    #define MODE_AND_OVERSAMPLING 0x25U
    #define INACTIVE_DURATION_AND_FILTER 0x40U
    #define HUMADITY_OVERSAMPLE 0x1U
    #define REG_ADDRESS 0xf7U
    #define END_OF_MEM_MAP 0xfeU
    #define BME280_SCL_PIN 27
    #define BME280_SDA_PIN 26
    #define PACKET_TYPE_START 1
    
    /* BME280 instance. */
    static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(BME280_INSTANCE_ID);
    
    /* Indicates if operation on TWI has ended. */
    static volatile bool m_xfer_done = false;
    
    /**\name Internal macros */
    /* To identify osr settings selected by user */
    #define OVERSAMPLING_SETTINGS		UINT8_C(0x07)
    /* To identify filter and standby settings selected by user */
    #define FILTER_STANDBY_SETTINGS		UINT8_C(0x18)
    
    /*!
     * @brief This internal API puts the device to sleep mode.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     *
     * @return Result of API execution status.
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t put_device_to_sleep(const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API writes the power mode in the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[in] sensor_mode : Variable which contains the power mode to be set.
     *
     * @return Result of API execution status.
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t write_power_mode(uint8_t sensor_mode, const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API is used to validate the device pointer for
     * null conditions.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t null_ptr_check(const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API interleaves the register address between the
     * register data buffer for burst write operation.
     *
     * @param[in] reg_addr : Contains the register address array.
     * @param[out] temp_buff : Contains the temporary buffer to store the
     * register data and register address.
     * @param[in] reg_data : Contains the register data to be written in the
     * temporary buffer.
     * @param[in] len : No of bytes of data to be written for burst write.
     */
    static void interleave_reg_addr(const uint8_t *reg_addr, uint8_t *temp_buff, const uint8_t *reg_data, uint8_t len);
    
    /*!
     * @brief This internal API reads the calibration data from the sensor, parse
     * it and store in the device structure.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t get_calib_data(struct bme280_dev *dev);
    
    /*!
     *  @brief This internal API is used to parse the temperature and
     *  pressure calibration data and store it in the device structure.
     *
     *  @param[out] dev : Structure instance of bme280_dev to store the calib data.
     *  @param[in] reg_data : Contains the calibration data to be parsed.
     */
    static void parse_temp_press_calib_data(const uint8_t *reg_data, struct bme280_dev *dev);
    
    /*!
     *  @brief This internal API is used to parse the humidity calibration data
     *  and store it in device structure.
     *
     *  @param[out] dev : Structure instance of bme280_dev to store the calib data.
     *  @param[in] reg_data : Contains calibration data to be parsed.
     */
    static void parse_humidity_calib_data(const uint8_t *reg_data, struct bme280_dev *dev);
    
    /*!
     *  @brief This internal API is used to parse the pressure, temperature and
     *  humidity data and store it in the bme280_uncomp_data structure instance.
     *
     *  @param[in] reg_data : Contains the register data which needs to be parsed.
     *  @param[out] uncomp_data : Contains the uncompensated pressure, temperature
     *  and humidity data.
     */
    static void parse_sensor_data(const uint8_t *reg_data, struct bme280_uncomp_data *uncomp_data);
    
    /*!
     * @brief This internal API is used to compensate the pressure and/or
     * temperature and/or humidity data according to the component selected by the
     * user.
     *
     * @param[in] sensor_comp : Used to select pressure and/or temperature and/or
     * humidity.
     * @param[in] uncomp_data : Contains the uncompensated pressure, temperature and
     * humidity data.
     * @param[out] comp_data : Contains the compensated pressure and/or temperature
     * and/or humidity data.
     * @param[in] calib_data : Pointer to the calibration data structure.
     *
     * @return Result of API execution status.
     * @retval zero -> Success / -ve value -> Error
     */
    static int8_t compensate_data(uint8_t sensor_comp, const struct bme280_uncomp_data *uncomp_data,
                         struct bme280_data *comp_data, struct bme280_calib_data *calib_data);
    
    #ifdef BME280_FLOAT_ENABLE
    /*!
     * @brief This internal API is used to compensate the raw pressure data and
     * return the compensated pressure data in double data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated pressure data.
     * @param[in] calib_data : Pointer to the calibration data structure.
     *
     * @return Compensated pressure data.
     * @retval Compensated pressure data in double.
     */
    static double compensate_pressure(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data);
    
    /*!
     * @brief This internal API is used to compensate the raw humidity data and
     * return the compensated humidity data in double data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated humidity data.
     * @param[in] calib_data : Pointer to the calibration data structure.
     *
     * @return Compensated humidity data.
     * @retval Compensated humidity data in double.
     */
    static double compensate_humidity(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data);
    
    /*!
     * @brief This internal API is used to compensate the raw temperature data and
     * return the compensated temperature data in double data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated temperature data.
     * @param[in] calib_data : Pointer to calibration data structure.
     *
     * @return Compensated temperature data.
     * @retval Compensated temperature data in double.
     */
    static  double compensate_temperature(const struct bme280_uncomp_data *uncomp_data,
                            struct bme280_calib_data *calib_data);
    
    #else
    
    /*!
     * @brief This internal API is used to compensate the raw temperature data and
     * return the compensated temperature data in integer data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated temperature data.
     * @param[in] calib_data : Pointer to calibration data structure.
     *
     * @return Compensated temperature data.
     * @retval Compensated temperature data in integer.
     */
    static int32_t compensate_temperature(const struct bme280_uncomp_data *uncomp_data,
                            struct bme280_calib_data *calib_data);
    
    /*!
     * @brief This internal API is used to compensate the raw pressure data and
     * return the compensated pressure data in integer data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated pressure data.
     * @param[in] calib_data : Pointer to the calibration data structure.
     *
     * @return Compensated pressure data.
     * @retval Compensated pressure data in integer.
     */
    static uint32_t compensate_pressure(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data);
    
    /*!
     * @brief This internal API is used to compensate the raw humidity data and
     * return the compensated humidity data in integer data type.
     *
     * @param[in] uncomp_data : Contains the uncompensated humidity data.
     * @param[in] calib_data : Pointer to the calibration data structure.
     *
     * @return Compensated humidity data.
     * @retval Compensated humidity data in integer.
     */
    static uint32_t compensate_humidity(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data);
    
    #endif
    
    /*!
     * @brief This internal API is used to identify the settings which the user
     * wants to modify in the sensor.
     *
     * @param[in] sub_settings : Contains the settings subset to identify particular
     * group of settings which the user is interested to change.
     * @param[in] desired_settings : Contains the user specified settings.
     *
     * @return Indicates whether user is interested to modify the settings which
     * are related to sub_settings.
     * @retval True -> User wants to modify this group of settings
     * @retval False -> User does not want to modify this group of settings
     */
    static uint8_t are_settings_changed(uint8_t sub_settings, uint8_t desired_settings);
    
    /*!
     * @brief This API sets the humidity oversampling settings of the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t set_osr_humidity_settings(const struct bme280_settings *settings, const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API sets the oversampling settings for pressure,
     * temperature and humidity in the sensor.
     *
     * @param[in] desired_settings : Variable used to select the settings which
     * are to be set.
     * @param[in] dev : Structure instance of bme280_dev.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t set_osr_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                    const struct bme280_dev *dev);
    
    /*!
     * @brief This API sets the pressure and/or temperature oversampling settings
     * in the sensor according to the settings selected by the user.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[in] desired_settings: variable to select the pressure and/or
     * temperature oversampling settings.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t set_osr_press_temp_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                            const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API fills the pressure oversampling settings provided by
     * the user in the data buffer so as to write in the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[out] reg_data : Variable which is filled according to the pressure
     * oversampling data provided by the user.
     */
    static void fill_osr_press_settings(uint8_t *reg_data, const struct bme280_settings *settings);
    
    /*!
     * @brief This internal API fills the temperature oversampling settings provided
     * by the user in the data buffer so as to write in the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[out] reg_data : Variable which is filled according to the temperature
     * oversampling data provided by the user.
     */
    static void fill_osr_temp_settings(uint8_t *reg_data, const struct bme280_settings *settings);
    
    /*!
     * @brief This internal API sets the filter and/or standby duration settings
     * in the sensor according to the settings selected by the user.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[in] desired_settings : variable to select the filter and/or
     * standby duration settings.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t set_filter_standby_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                            const struct bme280_dev *dev);
    
    /*!
     * @brief This internal API fills the filter settings provided by the user
     * in the data buffer so as to write in the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[out] reg_data : Variable which is filled according to the filter
     * settings data provided by the user.
     */
    static void fill_filter_settings(uint8_t *reg_data, const struct bme280_settings *settings);
    
    /*!
     * @brief This internal API fills the standby duration settings provided by the
     * user in the data buffer so as to write in the sensor.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[out] reg_data : Variable which is filled according to the standby
     * settings data provided by the user.
     */
    static void fill_standby_settings(uint8_t *reg_data, const struct bme280_settings *settings);
    
    /*!
     * @brief This internal API parse the oversampling(pressure, temperature
     * and humidity), filter and standby duration settings and store in the
     * device structure.
     *
     * @param[out] dev : Structure instance of bme280_dev.
     * @param[in] reg_data : Register data to be parsed.
     */
    static void parse_device_settings(const uint8_t *reg_data, struct bme280_settings *settings);
    
    /*!
     * @brief This internal API reloads the already existing device settings in the
     * sensor after soft reset.
     *
     * @param[in] dev : Structure instance of bme280_dev.
     * @param[in] settings : Pointer variable which contains the settings to
     * be set in the sensor.
     *
     * @return Result of API execution status
     * @retval zero -> Success / +ve value -> Warning / -ve value -> Error
     */
    static int8_t reload_device_settings(const struct bme280_settings *settings, const struct bme280_dev *dev);
    
    /****************** Global Function Definitions *******************************/
    
    /*!
     *  @brief This API is the entry point.
     *  It reads the chip-id and calibration data from the sensor.
     */
    int8_t bme280_init(struct bme280_dev *dev)
    {
        int8_t rslt;
        /* chip id read try count */
        uint8_t try_count = 5;
        uint8_t chip_id = 0;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Proceed if null check is fine */
        if (rslt ==  BME280_OK) {
            while (try_count) {
                /* Read the chip-id of bme280 sensor */
                rslt = bme280_get_regs(BME280_CHIP_ID_ADDR, &chip_id, 1, dev);
                /* Check for chip id validity */
                if ((rslt == BME280_OK) && (chip_id == BME280_CHIP_ID)) {
                    dev->chip_id = chip_id;
                    /* Reset the sensor */
                    rslt = bme280_soft_reset(dev);
                    if (rslt == BME280_OK) {
                        /* Read the calibration data */
                        rslt = get_calib_data(dev);
                    }
                    break;
                }
                /* Wait for 1 ms */
                dev->delay_ms(1);
                --try_count;
            }
            /* Chip id check failed */
            if (!try_count)
                rslt = BME280_E_DEV_NOT_FOUND;
        }
    
        return rslt;
    }

    /*!
     * @brief This API reads the data from the given register address of the sensor.
     */
    int8_t bme280_get_regs(uint8_t reg_addr, uint8_t *reg_data, uint16_t len, const struct bme280_dev *dev)
    {
        int8_t rslt;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Proceed if null check is fine */
        if (rslt == BME280_OK) {
            /* If interface selected is SPI */
            if (dev->intf != BME280_I2C_INTF)
                reg_addr = reg_addr | 0x80;
            /* Read the data  */
            rslt = dev->read(dev->dev_id, reg_addr, reg_data, len);
            /* Check for communication error */
            if (rslt != BME280_OK)
                rslt = BME280_E_COMM_FAIL;
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API writes the given data to the register address
     * of the sensor.
     */
    int8_t bme280_set_regs(uint8_t *reg_addr, const uint8_t *reg_data, uint8_t len, const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t temp_buff[20]; /* Typically not to write more than 10 registers */
        if(len > 10)
            len = 10;
    
        uint16_t temp_len;
        uint8_t reg_addr_cnt;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Check for arguments validity */
        if ((rslt ==  BME280_OK) && (reg_addr != NULL) && (reg_data != NULL)) {
            if (len != 0) {
                temp_buff[0] = reg_data[0];
                /* If interface selected is SPI */
                if (dev->intf != BME280_I2C_INTF) {
                    for (reg_addr_cnt = 0; reg_addr_cnt < len; reg_addr_cnt++)
                        reg_addr[reg_addr_cnt] = reg_addr[reg_addr_cnt] & 0x7F;
                }
                /* Burst write mode */
                if (len > 1) {
                    /* Interleave register address w.r.t data for
                    burst write*/
                    interleave_reg_addr(reg_addr, temp_buff, reg_data, len);
                    temp_len = len * 2;
                } else {
                    temp_len = len;
                }
                rslt = dev->write(dev->dev_id, reg_addr[0], temp_buff, temp_len);
                /* Check for communication error */
                if (rslt != BME280_OK)
                    rslt = BME280_E_COMM_FAIL;
            } else {
                rslt = BME280_E_INVALID_LEN;
            }
        } else {
            rslt = BME280_E_NULL_PTR;
        }
    
    
        return rslt;
    }
    
    /*!
     * @brief This API sets the oversampling, filter and standby duration
     * (normal mode) settings in the sensor.
     */
    int8_t bme280_set_sensor_settings(uint8_t desired_settings, const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t sensor_mode;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Proceed if null check is fine */
        if (rslt == BME280_OK) {
            rslt = bme280_get_sensor_mode(&sensor_mode, dev);
            if ((rslt == BME280_OK) && (sensor_mode != BME280_SLEEP_MODE))
                rslt = put_device_to_sleep(dev);
            if (rslt == BME280_OK) {
                /* Check if user wants to change oversampling
                   settings */
                if (are_settings_changed(OVERSAMPLING_SETTINGS, desired_settings))
                    rslt = set_osr_settings(desired_settings, &dev->settings, dev);
                /* Check if user wants to change filter and/or
                   standby settings */
                if ((rslt == BME280_OK) && are_settings_changed(FILTER_STANDBY_SETTINGS, desired_settings))
                    rslt = set_filter_standby_settings(desired_settings, &dev->settings, dev);
            }
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API gets the oversampling, filter and standby duration
     * (normal mode) settings from the sensor.
     */
    int8_t bme280_get_sensor_settings(struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_data[4];
    
