Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Proceed if null check is fine */
        if (rslt == BME280_OK) {
            rslt = bme280_get_regs(BME280_CTRL_HUM_ADDR, reg_data, 4, dev);
            if (rslt == BME280_OK)
                parse_device_settings(reg_data, &dev->settings);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API sets the power mode of the sensor.
     */
    int8_t bme280_set_sensor_mode(uint8_t sensor_mode, const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t last_set_mode;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
    
        if (rslt == BME280_OK) {
            rslt = bme280_get_sensor_mode(&last_set_mode, dev);
            /* If the sensor is not in sleep mode put the device to sleep
               mode */
            if ((rslt == BME280_OK) && (last_set_mode != BME280_SLEEP_MODE))
                rslt = put_device_to_sleep(dev);
            /* Set the power mode */
            if (rslt == BME280_OK)
                rslt = write_power_mode(sensor_mode, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API gets the power mode of the sensor.
     */
    int8_t bme280_get_sensor_mode(uint8_t *sensor_mode, const struct bme280_dev *dev)
    {
        int8_t rslt;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
    
        if (rslt == BME280_OK) {
            /* Read the power mode register */
            rslt = bme280_get_regs(BME280_PWR_CTRL_ADDR, sensor_mode, 1, dev);
            /* Assign the power mode in the device structure */
            *sensor_mode = BME280_GET_BITS_POS_0(*sensor_mode, BME280_SENSOR_MODE);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API performs the soft reset of the sensor.
     */
    int8_t bme280_soft_reset(const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_addr = BME280_RESET_ADDR;
        /* 0xB6 is the soft reset command */
        uint8_t soft_rst_cmd = 0xB6;
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
        /* Proceed if null check is fine */
        if (rslt == BME280_OK) {
            /* Write the soft reset command in the sensor */
            rslt = bme280_set_regs(&reg_addr, &soft_rst_cmd, 1, dev);
            /* As per data sheet, startup time is 2 ms. */
            dev->delay_ms(2);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API reads the pressure, temperature and humidity data from the
     * sensor, compensates the data and store it in the bme280_data structure
     * instance passed by the user.
     */
    int8_t bme280_get_sensor_data(uint8_t sensor_comp, struct bme280_data *comp_data, struct bme280_dev *dev)
    {
        int8_t rslt;
        /* Array to store the pressure, temperature and humidity data read from
        the sensor */
        uint8_t reg_data[BME280_P_T_H_DATA_LEN] = {0};
        struct bme280_uncomp_data uncomp_data = {0};
    
        /* Check for null pointer in the device structure*/
        rslt = null_ptr_check(dev);
    
        if ((rslt == BME280_OK) && (comp_data != NULL)) {
            /* Read the pressure and temperature data from the sensor */
            rslt = bme280_get_regs(BME280_DATA_ADDR, reg_data, BME280_P_T_H_DATA_LEN, dev);
    
            if (rslt == BME280_OK) {
                /* Parse the read data from the sensor */
                parse_sensor_data(reg_data, &uncomp_data);
                /* Compensate the pressure and/or temperature and/or
                   humidity data from the sensor */
                rslt = compensate_data(sensor_comp, &uncomp_data, comp_data, &dev->calib_data);
            }
        } else {
            rslt = BME280_E_NULL_PTR;
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API sets the oversampling settings for pressure,
     * temperature and humidity in the sensor.
     */
    static int8_t set_osr_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                    const struct bme280_dev *dev)
    {
        int8_t rslt = BME280_W_INVALID_OSR_MACRO;
    
        if (desired_settings & BME280_OSR_HUM_SEL)
            rslt = set_osr_humidity_settings(settings, dev);
        if (desired_settings & (BME280_OSR_PRESS_SEL | BME280_OSR_TEMP_SEL))
            rslt = set_osr_press_temp_settings(desired_settings, settings, dev);
    
        return rslt;
    }
    
    /*!
     * @brief This API sets the humidity oversampling settings of the sensor.
     */
    static int8_t set_osr_humidity_settings(const struct bme280_settings *settings, const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t ctrl_hum;
        uint8_t ctrl_meas;
        uint8_t reg_addr = BME280_CTRL_HUM_ADDR;
    
        ctrl_hum = settings->osr_h & BME280_CTRL_HUM_MSK;
        /* Write the humidity control value in the register */
        rslt = bme280_set_regs(&reg_addr, &ctrl_hum, 1, dev);
        /* Humidity related changes will be only effective after a
           write operation to ctrl_meas register */
        if (rslt == BME280_OK) {
            reg_addr = BME280_CTRL_MEAS_ADDR;
            rslt = bme280_get_regs(reg_addr, &ctrl_meas, 1, dev);
            if (rslt == BME280_OK)
                rslt = bme280_set_regs(&reg_addr, &ctrl_meas, 1, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This API sets the pressure and/or temperature oversampling settings
     * in the sensor according to the settings selected by the user.
     */
    static int8_t set_osr_press_temp_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                            const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_addr = BME280_CTRL_MEAS_ADDR;
        uint8_t reg_data;
    
        rslt = bme280_get_regs(reg_addr, &reg_data, 1, dev);
    
