Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
        if (rslt == BME280_OK) {
            if (desired_settings & BME280_OSR_PRESS_SEL)
                fill_osr_press_settings(&reg_data, settings);
            if (desired_settings & BME280_OSR_TEMP_SEL)
                fill_osr_temp_settings(&reg_data, settings);
            /* Write the oversampling settings in the register */
            rslt = bme280_set_regs(&reg_addr, &reg_data, 1, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API sets the filter and/or standby duration settings
     * in the sensor according to the settings selected by the user.
     */
    static int8_t set_filter_standby_settings(uint8_t desired_settings, const struct bme280_settings *settings,
                            const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_addr = BME280_CONFIG_ADDR;
        uint8_t reg_data;
    
        rslt = bme280_get_regs(reg_addr, &reg_data, 1, dev);
    
        if (rslt == BME280_OK) {
            if (desired_settings & BME280_FILTER_SEL)
                fill_filter_settings(&reg_data, settings);
            if (desired_settings & BME280_STANDBY_SEL)
                fill_standby_settings(&reg_data, settings);
            /* Write the oversampling settings in the register */
            rslt = bme280_set_regs(&reg_addr, &reg_data, 1, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API fills the filter settings provided by the user
     * in the data buffer so as to write in the sensor.
     */
    static void fill_filter_settings(uint8_t *reg_data, const struct bme280_settings *settings)
    {
        *reg_data = BME280_SET_BITS(*reg_data, BME280_FILTER, settings->filter);
    }
    
    /*!
     * @brief This internal API fills the standby duration settings provided by
     * the user in the data buffer so as to write in the sensor.
     */
    static void fill_standby_settings(uint8_t *reg_data, const struct bme280_settings *settings)
    {
        *reg_data = BME280_SET_BITS(*reg_data, BME280_STANDBY, settings->standby_time);
    }
    
    /*!
     * @brief This internal API fills the pressure oversampling settings provided by
     * the user in the data buffer so as to write in the sensor.
     */
    static void fill_osr_press_settings(uint8_t *reg_data, const struct bme280_settings *settings)
    {
        *reg_data = BME280_SET_BITS(*reg_data, BME280_CTRL_PRESS, settings->osr_p);
    }
    
    /*!
     * @brief This internal API fills the temperature oversampling settings
     * provided by the user in the data buffer so as to write in the sensor.
     */
    static void fill_osr_temp_settings(uint8_t *reg_data, const struct bme280_settings *settings)
    {
        *reg_data = BME280_SET_BITS(*reg_data, BME280_CTRL_TEMP, settings->osr_t);
    }
    
    /*!
     * @brief This internal API parse the oversampling(pressure, temperature
     * and humidity), filter and standby duration settings and store in the
     * device structure.
     */
    static void parse_device_settings(const uint8_t *reg_data, struct bme280_settings *settings)
    {
        settings->osr_h = BME280_GET_BITS_POS_0(reg_data[0], BME280_CTRL_HUM);
        settings->osr_p = BME280_GET_BITS(reg_data[2], BME280_CTRL_PRESS);
        settings->osr_t = BME280_GET_BITS(reg_data[2], BME280_CTRL_TEMP);
        settings->filter = BME280_GET_BITS(reg_data[3], BME280_FILTER);
        settings->standby_time = BME280_GET_BITS(reg_data[3], BME280_STANDBY);
    }
    /*!
     * @brief This internal API writes the power mode in the sensor.
     */
    static int8_t write_power_mode(uint8_t sensor_mode, const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_addr = BME280_PWR_CTRL_ADDR;
        /* Variable to store the value read from power mode register */
        uint8_t sensor_mode_reg_val;
    
        /* Read the power mode register */
        rslt = bme280_get_regs(reg_addr, &sensor_mode_reg_val, 1, dev);
        /* Set the power mode */
        if (rslt == BME280_OK) {
            sensor_mode_reg_val = BME280_SET_BITS_POS_0(sensor_mode_reg_val, BME280_SENSOR_MODE, sensor_mode);
            /* Write the power mode in the register */
            rslt = bme280_set_regs(&reg_addr, &sensor_mode_reg_val, 1, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API puts the device to sleep mode.
     */
    static int8_t put_device_to_sleep(const struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_data[4];
        struct bme280_settings settings;
    
        rslt = bme280_get_regs(BME280_CTRL_HUM_ADDR, reg_data, 4, dev);
        if (rslt == BME280_OK) {
            parse_device_settings(reg_data, &settings);
            rslt = bme280_soft_reset(dev);
            if (rslt == BME280_OK)
                rslt = reload_device_settings(&settings, dev);
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API reloads the already existing device settings in
     * the sensor after soft reset.
     */
    static int8_t reload_device_settings(const struct bme280_settings *settings, const struct bme280_dev *dev)
    {
        int8_t rslt;
    
        rslt = set_osr_settings(BME280_ALL_SETTINGS_SEL, settings, dev);
        if (rslt == BME280_OK)
            rslt = set_filter_standby_settings(BME280_ALL_SETTINGS_SEL, settings, dev);
    
        return rslt;
    }
    
    /*!
     *  @brief This internal API is used to parse the pressure, temperature and
     *  humidity data and store it in the bme280_uncomp_data structure instance.
     */
    static void parse_sensor_data(const uint8_t *reg_data, struct bme280_uncomp_data *uncomp_data)
    {
        /* Variables to store the sensor data */
        uint32_t data_xlsb;
        uint32_t data_lsb;
        uint32_t data_msb;
    
        /* Store the parsed register values for pressure data */
        data_msb = (uint32_t)reg_data[0] << 12;
        data_lsb = (uint32_t)reg_data[1] << 4;
        data_xlsb = (uint32_t)reg_data[2] >> 4;
        uncomp_data->pressure = data_msb | data_lsb | data_xlsb;
    
        /* Store the parsed register values for temperature data */
        data_msb = (uint32_t)reg_data[3] << 12;
        data_lsb = (uint32_t)reg_data[4] << 4;
        data_xlsb = (uint32_t)reg_data[5] >> 4;
        uncomp_data->temperature = data_msb | data_lsb | data_xlsb;
    
        /* Store the parsed register values for temperature data */
        data_lsb = (uint32_t)reg_data[6] << 8;
        data_msb = (uint32_t)reg_data[7];
        uncomp_data->humidity = data_msb | data_lsb;
    }
    
    /*!
     * @brief This internal API is used to compensate the pressure and/or
     * temperature and/or humidity data according to the component selected
     * by the user.
     */
    static int8_t compensate_data(uint8_t sensor_comp, const struct bme280_uncomp_data *uncomp_data,
                         struct bme280_data *comp_data, struct bme280_calib_data *calib_data)
    {
        int8_t rslt = BME280_OK;
    
        if ((uncomp_data != NULL) && (comp_data != NULL) && (calib_data != NULL)) {
            /* Initialize to zero */
            comp_data->temperature = 0;
            comp_data->pressure = 0;
            comp_data->humidity = 0;
            /* If pressure or temperature component is selected */
            if (sensor_comp & (BME280_PRESS | BME280_TEMP | BME280_HUM)) {
                /* Compensate the temperature data */
                comp_data->temperature = compensate_temperature(uncomp_data, calib_data);
            }
            if (sensor_comp & BME280_PRESS) {
                /* Compensate the pressure data */
                comp_data->pressure = compensate_pressure(uncomp_data, calib_data);
            }
            if (sensor_comp & BME280_HUM) {
                /* Compensate the humidity data */
                comp_data->humidity = compensate_humidity(uncomp_data, calib_data);
            }
        } else {
            rslt = BME280_E_NULL_PTR;
        }
    
        return rslt;
    }
    
    #ifdef BME280_FLOAT_ENABLE
    /*!
     * @brief This internal API is used to compensate the raw temperature data and
     * return the compensated temperature data in double data type.
     */
    static double compensate_temperature(const struct bme280_uncomp_data *uncomp_data,
                            struct bme280_calib_data *calib_data)
    {
        double var1;
        double var2;
        double temperature;
        double temperature_min = -40;
        double temperature_max = 85;
    
        var1 = ((double)uncomp_data->temperature) / 16384.0 - ((double)calib_data->dig_T1) / 1024.0;
        var1 = var1 * ((double)calib_data->dig_T2);
        var2 = (((double)uncomp_data->temperature) / 131072.0 - ((double)calib_data->dig_T1) / 8192.0);
        var2 = (var2 * var2) * ((double)calib_data->dig_T3);
        calib_data->t_fine = (int32_t)(var1 + var2);
        temperature = (var1 + var2) / 5120.0;
    
        if (temperature < temperature_min)
            temperature = temperature_min;
        else if (temperature > temperature_max)
            temperature = temperature_max;
    
        return temperature;
    }
    
    /*!
     * @brief This internal API is used to compensate the raw pressure data and
     * return the compensated pressure data in double data type.
     */
    static double compensate_pressure(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data)
    {
        double var1;
        double var2;
        double var3;
        double pressure;
        double pressure_min = 30000.0;
        double pressure_max = 110000.0;
    
        var1 = ((double)calib_data->t_fine / 2.0) - 64000.0;
        var2 = var1 * var1 * ((double)calib_data->dig_P6) / 32768.0;
        var2 = var2 + var1 * ((double)calib_data->dig_P5) * 2.0;
        var2 = (var2 / 4.0) + (((double)calib_data->dig_P4) * 65536.0);
        var3 = ((double)calib_data->dig_P3) * var1 * var1 / 524288.0;
        var1 = (var3 + ((double)calib_data->dig_P2) * var1) / 524288.0;
        var1 = (1.0 + var1 / 32768.0) * ((double)calib_data->dig_P1);
        /* avoid exception caused by division by zero */
        if (var1) {
            pressure = 1048576.0 - (double) uncomp_data->pressure;
            pressure = (pressure - (var2 / 4096.0)) * 6250.0 / var1;
            var1 = ((double)calib_data->dig_P9) * pressure * pressure / 2147483648.0;
            var2 = pressure * ((double)calib_data->dig_P8) / 32768.0;
            pressure = pressure + (var1 + var2 + ((double)calib_data->dig_P7)) / 16.0;
    
            if (pressure < pressure_min)
                pressure = pressure_min;
            else if (pressure > pressure_max)
                pressure = pressure_max;
        } else { /* Invalid case */
            pressure = pressure_min;
        }
    
        return pressure;
    }
    
    /*!
     * @brief This internal API is used to compensate the raw humidity data and
     * return the compensated humidity data in double data type.
     */
    static double compensate_humidity(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data)
    {
        double humidity;
        double humidity_min = 0.0;
        double humidity_max = 100.0;
        double var1;
        double var2;
        double var3;
        double var4;
        double var5;
        double var6;
    
        var1 = ((double)calib_data->t_fine) - 76800.0;
        var2 = (((double)calib_data->dig_H4) * 64.0 + (((double)calib_data->dig_H5) / 16384.0) * var1);
        var3 = uncomp_data->humidity - var2;
        var4 = ((double)calib_data->dig_H2) / 65536.0;
        var5 = (1.0 + (((double)calib_data->dig_H3) / 67108864.0) * var1);
        var6 = 1.0 + (((double)calib_data->dig_H6) / 67108864.0) * var1 * var5;
        var6 = var3 * var4 * (var5 * var6);
        humidity = var6 * (1.0 - ((double)calib_data->dig_H1) * var6 / 524288.0);
    
        if (humidity > humidity_max)
            humidity = humidity_max;
        else if (humidity < humidity_min)
            humidity = humidity_min;
    
        return humidity;
    }
    
    #else
    /*!
     * @brief This internal API is used to compensate the raw temperature data and
     * return the compensated temperature data in integer data type.
     */
    static int32_t compensate_temperature(const struct bme280_uncomp_data *uncomp_data,
                            struct bme280_calib_data *calib_data)
    {
        int32_t var1;
        int32_t var2;
        int32_t temperature;
        int32_t temperature_min = -4000;
        int32_t temperature_max = 8500;
    
        var1 = (int32_t)((uncomp_data->temperature / 8) - ((int32_t)calib_data->dig_T1 * 2));
        var1 = (var1 * ((int32_t)calib_data->dig_T2)) / 2048;
        var2 = (int32_t)((uncomp_data->temperature / 16) - ((int32_t)calib_data->dig_T1));
        var2 = (((var2 * var2) / 4096) * ((int32_t)calib_data->dig_T3)) / 16384;
        calib_data->t_fine = var1 + var2;
        temperature = (calib_data->t_fine * 5 + 128) / 256;
    
        if (temperature < temperature_min)
            temperature = temperature_min;
        else if (temperature > temperature_max)
            temperature = temperature_max;
    
        return temperature;
    }
    #ifdef BME280_64BIT_ENABLE
    /*!
     * @brief This internal API is used to compensate the raw pressure data and
     * return the compensated pressure data in integer data type with higher
     * accuracy.
     */
    static uint32_t compensate_pressure(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data)
    {
        int64_t var1;
        int64_t var2;
        int64_t var3;
        int64_t var4;
        uint32_t pressure;
        uint32_t pressure_min = 3000000;
        uint32_t pressure_max = 11000000;
    
        var1 = ((int64_t)calib_data->t_fine) - 128000;
        var2 = var1 * var1 * (int64_t)calib_data->dig_P6;
        var2 = var2 + ((var1 * (int64_t)calib_data->dig_P5) * 131072);
        var2 = var2 + (((int64_t)calib_data->dig_P4) * 34359738368);
        var1 = ((var1 * var1 * (int64_t)calib_data->dig_P3) / 256) + ((var1 * ((int64_t)calib_data->dig_P2) * 4096));
        var3 = ((int64_t)1) * 140737488355328;
        var1 = (var3 + var1) * ((int64_t)calib_data->dig_P1) / 8589934592;
    
