Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
        /* To avoid divide by zero exception */
        if (var1 != 0) {
            var4 = 1048576 - uncomp_data->pressure;
            var4 = (((var4 * 2147483648) - var2) * 3125) / var1;
            var1 = (((int64_t)calib_data->dig_P9) * (var4 / 8192) * (var4 / 8192)) / 33554432;
            var2 = (((int64_t)calib_data->dig_P8) * var4) / 524288;
            var4 = ((var4 + var1 + var2) / 256) + (((int64_t)calib_data->dig_P7) * 16);
            pressure = (uint32_t)(((var4 / 2) * 100) / 128);
    
            if (pressure < pressure_min)
                pressure = pressure_min;
            else if (pressure > pressure_max)
                pressure = pressure_max;
        } else {
            pressure = pressure_min;
        }
    
        return pressure;
    }
    #else
    /*!
     * @brief This internal API is used to compensate the raw pressure data and
     * return the compensated pressure data in integer data type.
     */
    static uint32_t compensate_pressure(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data)
    {
        int32_t var1;
        int32_t var2;
        int32_t var3;
        int32_t var4;
        uint32_t var5;
        uint32_t pressure;
        uint32_t pressure_min = 30000;
        uint32_t pressure_max = 110000;
    
        var1 = (((int32_t)calib_data->t_fine) / 2) - (int32_t)64000;
        var2 = (((var1 / 4) * (var1 / 4)) / 2048) * ((int32_t)calib_data->dig_P6);
        var2 = var2 + ((var1 * ((int32_t)calib_data->dig_P5)) * 2);
        var2 = (var2 / 4) + (((int32_t)calib_data->dig_P4) * 65536);
        var3 = (calib_data->dig_P3 * (((var1 / 4) * (var1 / 4)) / 8192)) / 8;
        var4 = (((int32_t)calib_data->dig_P2) * var1) / 2;
        var1 = (var3 + var4) / 262144;
        var1 = (((32768 + var1)) * ((int32_t)calib_data->dig_P1)) / 32768;
         /* avoid exception caused by division by zero */
        if (var1) {
            var5 = (uint32_t)((uint32_t)1048576) - uncomp_data->pressure;
            pressure = ((uint32_t)(var5 - (uint32_t)(var2 / 4096))) * 3125;
            if (pressure < 0x80000000)
                pressure = (pressure << 1) / ((uint32_t)var1);
            else
                pressure = (pressure / (uint32_t)var1) * 2;
    
            var1 = (((int32_t)calib_data->dig_P9) * ((int32_t)(((pressure / 8) * (pressure / 8)) / 8192))) / 4096;
            var2 = (((int32_t)(pressure / 4)) * ((int32_t)calib_data->dig_P8)) / 8192;
            pressure = (uint32_t)((int32_t)pressure + ((var1 + var2 + calib_data->dig_P7) / 16));
    
            if (pressure < pressure_min)
                pressure = pressure_min;
            else if (pressure > pressure_max)
                pressure = pressure_max;
        } else {
            pressure = pressure_min;
        }
    
        return pressure;
    }
    #endif
    
    /*!
     * @brief This internal API is used to compensate the raw humidity data and
     * return the compensated humidity data in integer data type.
     */
    static uint32_t compensate_humidity(const struct bme280_uncomp_data *uncomp_data,
                            const struct bme280_calib_data *calib_data)
    {
        int32_t var1;
        int32_t var2;
        int32_t var3;
        int32_t var4;
        int32_t var5;
        uint32_t humidity;
        uint32_t humidity_max = 100000;
    
        var1 = calib_data->t_fine - ((int32_t)76800);
        var2 = (int32_t)(uncomp_data->humidity * 16384);
        var3 = (int32_t)(((int32_t)calib_data->dig_H4) * 1048576);
        var4 = ((int32_t)calib_data->dig_H5) * var1;
        var5 = (((var2 - var3) - var4) + (int32_t)16384) / 32768;
        var2 = (var1 * ((int32_t)calib_data->dig_H6)) / 1024;
        var3 = (var1 * ((int32_t)calib_data->dig_H3)) / 2048;
        var4 = ((var2 * (var3 + (int32_t)32768)) / 1024) + (int32_t)2097152;
        var2 = ((var4 * ((int32_t)calib_data->dig_H2)) + 8192) / 16384;
        var3 = var5 * var2;
        var4 = ((var3 / 32768) * (var3 / 32768)) / 128;
        var5 = var3 - ((var4 * ((int32_t)calib_data->dig_H1)) / 16);
        var5 = (var5 < 0 ? 0 : var5);
        var5 = (var5 > 419430400 ? 419430400 : var5);
        humidity = (uint32_t)(var5 / 4096);
    
        if (humidity > humidity_max)
            humidity = humidity_max;
    
        return humidity;
    }
    #endif
    
    /*!
     * @brief This internal API reads the calibration data from the sensor, parse
     * it and store in the device structure.
     */
    static int8_t get_calib_data(struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t reg_addr = BME280_TEMP_PRESS_CALIB_DATA_ADDR;
        /* Array to store calibration data */
        uint8_t calib_data[BME280_TEMP_PRESS_CALIB_DATA_LEN] = {0};
    
        /* Read the calibration data from the sensor */
        rslt = bme280_get_regs(reg_addr, calib_data, BME280_TEMP_PRESS_CALIB_DATA_LEN, dev);
    
        if (rslt == BME280_OK) {
            /* Parse temperature and pressure calibration data and store
               it in device structure */
            parse_temp_press_calib_data(calib_data, dev);
    
            reg_addr = BME280_HUMIDITY_CALIB_DATA_ADDR;
            /* Read the humidity calibration data from the sensor */
            rslt = bme280_get_regs(reg_addr, calib_data, BME280_HUMIDITY_CALIB_DATA_LEN, dev);
            if (rslt == BME280_OK) {
                /* Parse humidity calibration data and store it in
                   device structure */
                parse_humidity_calib_data(calib_data, dev);
            }
        }
    
        return rslt;
    }
    
    /*!
     * @brief This internal API interleaves the register address between the
     * register data buffer for burst write operation.
     */
    static void interleave_reg_addr(const uint8_t *reg_addr, uint8_t *temp_buff, const uint8_t *reg_data, uint8_t len)
    {
        uint8_t index;
    
        for (index = 1; index < len; index++) {
            temp_buff[(index * 2) - 1] = reg_addr[index];
            temp_buff[index * 2] = reg_data[index];
        }
    }
    
    /*!
     *  @brief This internal API is used to parse the temperature and
     *  pressure calibration data and store it in device structure.
     */
    static void parse_temp_press_calib_data(const uint8_t *reg_data, struct bme280_dev *dev)
    {
        struct bme280_calib_data *calib_data = &dev->calib_data;
    
        calib_data->dig_T1 = BME280_CONCAT_BYTES(reg_data[1], reg_data[0]);
        calib_data->dig_T2 = (int16_t)BME280_CONCAT_BYTES(reg_data[3], reg_data[2]);
        calib_data->dig_T3 = (int16_t)BME280_CONCAT_BYTES(reg_data[5], reg_data[4]);
        calib_data->dig_P1 = BME280_CONCAT_BYTES(reg_data[7], reg_data[6]);
        calib_data->dig_P2 = (int16_t)BME280_CONCAT_BYTES(reg_data[9], reg_data[8]);
        calib_data->dig_P3 = (int16_t)BME280_CONCAT_BYTES(reg_data[11], reg_data[10]);
        calib_data->dig_P4 = (int16_t)BME280_CONCAT_BYTES(reg_data[13], reg_data[12]);
        calib_data->dig_P5 = (int16_t)BME280_CONCAT_BYTES(reg_data[15], reg_data[14]);
        calib_data->dig_P6 = (int16_t)BME280_CONCAT_BYTES(reg_data[17], reg_data[16]);
        calib_data->dig_P7 = (int16_t)BME280_CONCAT_BYTES(reg_data[19], reg_data[18]);
        calib_data->dig_P8 = (int16_t)BME280_CONCAT_BYTES(reg_data[21], reg_data[20]);
        calib_data->dig_P9 = (int16_t)BME280_CONCAT_BYTES(reg_data[23], reg_data[22]);
        calib_data->dig_H1 = reg_data[25];
    
