Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
    }
    
    /*!
     *  @brief This internal API is used to parse the humidity calibration data
     *  and store it in device structure.
     */
    static void parse_humidity_calib_data(const uint8_t *reg_data, struct bme280_dev *dev)
    {
        struct bme280_calib_data *calib_data = &dev->calib_data;
        int16_t dig_H4_lsb;
        int16_t dig_H4_msb;
        int16_t dig_H5_lsb;
        int16_t dig_H5_msb;
    
        calib_data->dig_H2 = (int16_t)BME280_CONCAT_BYTES(reg_data[1], reg_data[0]);
        calib_data->dig_H3 = reg_data[2];
    
        dig_H4_msb = (int16_t)(int8_t)reg_data[3] * 16;
        dig_H4_lsb = (int16_t)(reg_data[4] & 0x0F);
        calib_data->dig_H4 = dig_H4_msb | dig_H4_lsb;
    
        dig_H5_msb = (int16_t)(int8_t)reg_data[5] * 16;
        dig_H5_lsb = (int16_t)(reg_data[4] >> 4);
        calib_data->dig_H5 = dig_H5_msb | dig_H5_lsb;
        calib_data->dig_H6 = (int8_t)reg_data[6];
    }
    
    /*!
     * @brief This internal API is used to identify the settings which the user
     * wants to modify in the sensor.
     */
    static uint8_t are_settings_changed(uint8_t sub_settings, uint8_t desired_settings)
    {
        uint8_t settings_changed = FALSE;
    
        if (sub_settings & desired_settings) {
            /* User wants to modify this particular settings */
            settings_changed = TRUE;
        } else {
            /* User don't want to modify this particular settings */
            settings_changed = FALSE;
        }
    
        return settings_changed;
    }
    
    /*!
     * @brief This internal API is used to validate the device structure pointer for
     * null conditions.
     */
    static int8_t null_ptr_check(const struct bme280_dev *dev)
    {
        int8_t rslt;
    
        if ((dev == NULL) || (dev->read == NULL) || (dev->write == NULL) || (dev->delay_ms == NULL)) {
            /* Device structure pointer is not valid */
            rslt = BME280_E_NULL_PTR;
        } else {
            /* Device structure is fine */
            rslt = BME280_OK;
        }
    
        return rslt;
    }

    void user_delay_ms(uint32_t period)
    {
        nrf_delay_ms(period);
    }
    
    int8_t user_spi_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
    {
        int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
    
        /*
         * The parameter dev_id can be used as a variable to select which Chip Select pin has
         * to be set low to activate the relevant device on the SPI bus
         */
    
        /*
         * Data on the bus should be like
         * |----------------+---------------------+-------------|
         * | MOSI           | MISO                | Chip Select |
         * |----------------+---------------------|-------------|
         * | (don't care)   | (don't care)        | HIGH        |
         * | (reg_addr)     | (don't care)        | LOW         |
         * | (don't care)   | (reg_data[0])       | LOW         |
         * | (....)         | (....)              | LOW         |
         * | (don't care)   | (reg_data[len - 1]) | LOW         |
         * | (don't care)   | (don't care)        | HIGH        |
         * |----------------+---------------------|-------------|
         */
    
        return rslt;
    }
    
    int8_t user_spi_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
    {
        int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
    
        /*
         * The parameter dev_id can be used as a variable to select which Chip Select pin has
         * to be set low to activate the relevant device on the SPI bus
         */
    
        /*
         * Data on the bus should be like
         * |---------------------+--------------+-------------|
         * | MOSI                | MISO         | Chip Select |
         * |---------------------+--------------|-------------|
         * | (don't care)        | (don't care) | HIGH        |
         * | (reg_addr)          | (don't care) | LOW         |
         * | (reg_data[0])       | (don't care) | LOW         |
         * | (....)              | (....)       | LOW         |
         * | (reg_data[len - 1]) | (don't care) | LOW         |
         * | (don't care)        | (don't care) | HIGH        |
         * |---------------------+--------------|-------------|
         */
    
        return rslt;
    }
    
    int8_t my_i2c_rx(uint8_t addr, uint8_t *reg_data, uint16_t len) {
        int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
        ret_code_t err_code = nrf_drv_twi_rx(&m_twi, addr, reg_data, len);
        if (err_code != NRF_SUCCESS){
            rslt = -1;
        } else {
            // nrf_delay_ms(500);
            do
            {
                __WFE();
            } while (m_xfer_done == false);
            m_xfer_done = false;
        }
		return rslt;
    }

    int8_t my_i2c_tx(uint8_t addr, uint8_t *reg_data, uint16_t len) {
        int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
        m_xfer_done = false;
        ret_code_t err_code = nrf_drv_twi_tx(&m_twi, addr, reg_data, len, false);
        APP_ERROR_CHECK(err_code);
        do
        {
            __WFE();
        } while (m_xfer_done == false);
        m_xfer_done = false;
        return rslt;
	}

    int8_t user_i2c_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)

    {
    	int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */

        rslt = my_i2c_tx(dev_id, &reg_addr, 1);
        if (rslt == 0) {
            my_i2c_rx(dev_id, reg_data, len);
        }

        /*
         * The parameter dev_id can be used as a variable to store the I2C address of the device
         */
    
        /*
         * Data on the bus should be like
         * |------------+---------------------|
         * | I2C action | Data                |
         * |------------+---------------------|
         * | Start      | -                   |
         * | Write      | (reg_addr)          |
         * | Stop       | -                   |
         * | Start      | -                   |
         * | Read       | (reg_data[0])       |
         * | Read       | (....)              |
         * | Read       | (reg_data[len - 1]) |
         * | Stop       | -                   |
         * |------------+---------------------|
         */
    
        return rslt;
    }
    
