Jumperr-labs/nrf52_unity_examples/examples/peripherals/bme280/main.c
    int8_t user_i2c_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
    {
        int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */

        uint8_t * reg_addr_and_data = (uint8_t *) malloc(sizeof(uint8_t) * (len + 1));
        memcpy(reg_addr_and_data , &reg_addr, sizeof(uint8_t));
        memcpy(reg_addr_and_data + sizeof(uint8_t), reg_data, sizeof(uint8_t) * len);
        my_i2c_tx(dev_id, reg_addr_and_data, len + 1);
        /*
         * The parameter dev_id can be used as a variable to store the I2C address of the device
         */
    
        /*
         * Data on the bus should be like
         * |------------+---------------------|
         * | I2C action | Data                |
         * |------------+---------------------|
         * | Start      | -                   |
         * | Write      | (reg_addr)          |
         * | Write      | (reg_data[0])       |
         * | Write      | (....)              |
         * | Write      | (reg_data[len - 1]) |
         * | Stop       | -                   |
         * |------------+---------------------|
         */
        free(reg_addr_and_data);
        return rslt;
    }

    void print_sensor_data(struct bme280_data *comp_data)
    {
    #ifdef BME280_FLOAT_ENABLE
        NRF_LOG_INFO("  pressure: %d.\r\n", comp_data->pressure);
        NRF_LOG_INFO("  Temperature: %d.\r\n", comp_data->temperature);
        NRF_LOG_INFO("  humidity: %d.\r\n\r\n", comp_data->humidity);
        NRF_LOG_FLUSH();
    #else
        NRF_LOG_INFO("  pressure: %d.\r\n", comp_data->pressure);
        NRF_LOG_INFO("  Temperature: %d.\r\n", comp_data->temperature);
        NRF_LOG_INFO("  humidity: %d.\r\n\r\n", comp_data->humidity);
        NRF_LOG_FLUSH();
    #endif
    }

    int8_t stream_sensor_data_forced_mode(struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t settings_sel;
        struct bme280_data comp_data;
    
        /* Recommended mode of operation: Indoor navigation */
        dev->settings.osr_h = BME280_OVERSAMPLING_1X;
        dev->settings.osr_p = BME280_OVERSAMPLING_16X;
        dev->settings.osr_t = BME280_OVERSAMPLING_2X;
        dev->settings.filter = BME280_FILTER_COEFF_16;
    
        settings_sel = BME280_OSR_PRESS_SEL | BME280_OSR_TEMP_SEL | BME280_OSR_HUM_SEL | BME280_FILTER_SEL;
    
        rslt = bme280_set_sensor_settings(settings_sel, dev);
    
        NRF_LOG_INFO("Temperature, Pressure, Humidity\r\n");
        NRF_LOG_FLUSH();
        /* Continuously stream sensor data */
        while (1) {
            rslt = bme280_set_sensor_mode(BME280_FORCED_MODE, dev);
            /* Wait for the measurement to complete and print data @25Hz */
            dev->delay_ms(40);
            rslt = bme280_get_sensor_data(BME280_ALL, &comp_data, dev);
            print_sensor_data(&comp_data);
        }
        return rslt;
    }

    int8_t stream_sensor_data_normal_mode(struct bme280_dev *dev)
    {
        int8_t rslt;
        uint8_t settings_sel;
        struct bme280_data comp_data;
    
        /* Recommended mode of operation: Indoor navigation */
        dev->settings.osr_h = BME280_OVERSAMPLING_1X;
        dev->settings.osr_p = BME280_OVERSAMPLING_16X;
        dev->settings.osr_t = BME280_OVERSAMPLING_2X;
        dev->settings.filter = BME280_FILTER_COEFF_16;
        dev->settings.standby_time = BME280_STANDBY_TIME_62_5_MS;
    
        settings_sel = BME280_OSR_PRESS_SEL;
        settings_sel |= BME280_OSR_TEMP_SEL;
        settings_sel |= BME280_OSR_HUM_SEL;
        settings_sel |= BME280_STANDBY_SEL;
        settings_sel |= BME280_FILTER_SEL;
        rslt = bme280_set_sensor_settings(settings_sel, dev);
        rslt = bme280_set_sensor_mode(BME280_NORMAL_MODE, dev);
    
        NRF_LOG_INFO("Temperature, Pressure, Humidity\r\n");
        NRF_LOG_FLUSH();
        while (1) {
            /* Delay while the sensor completes a measurement */
            dev->delay_ms(70);
            rslt = bme280_get_sensor_data(BME280_ALL, &comp_data, dev);
            print_sensor_data(&comp_data);
        }
    
        return rslt;
    }

    void bme_handler(nrf_drv_twi_evt_t const * p_event, void * p_context){
            switch (p_event->type){
                case NRF_DRV_TWI_EVT_DONE:
                    m_xfer_done = true;
                    break;
                default:
                    break;
            }
        }

    void twi_init (void)
    {
        ret_code_t err_code;
    
        const nrf_drv_twi_config_t bme280_config = {
           .scl                = BME280_SCL_PIN,
           .sda                = BME280_SDA_PIN,
           .frequency          = NRF_TWI_FREQ_100K,
           .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
           .clear_bus_init     = false
        };
    
        err_code = nrf_drv_twi_init(&m_twi, &bme280_config, bme_handler, NULL);
        APP_ERROR_CHECK(err_code);
    
        nrf_drv_twi_enable(&m_twi);
    }

    void uart_error_handle(app_uart_evt_t * p_event)
    {
        if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
        {
            APP_ERROR_HANDLER(p_event->data.error_communication);
        }
        else if (p_event->evt_type == APP_UART_FIFO_ERROR)
        {
            APP_ERROR_HANDLER(p_event->data.error_code);
        }
    }
    

   int main(void) {
        uint32_t err_code;
        err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);
    
        NRF_LOG_DEFAULT_BACKENDS_INIT();
                
        NRF_LOG_INFO("\r\nBME280 sensor example\r\n");
        NRF_LOG_FLUSH();
        twi_init();
        struct bme280_dev dev;
        int8_t rslt = BME280_OK;
        
        dev.dev_id = BME280_I2C_ADDR_PRIM;
        dev.intf = BME280_I2C_INTF;
        dev.read = user_i2c_read;
        dev.write = user_i2c_write;
        dev.delay_ms = user_delay_ms;

        rslt = bme280_init(&dev);

        NRF_LOG_INFO("result: %d\r\n", rslt);
        NRF_LOG_FLUSH();

        /* can be either forced or normal mode */
        // stream_sensor_data_normal_mode(%dev);
        stream_sensor_data_forced_mode(&dev);
       
        while(1) {}
    }



